using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class Database : MonoBehaviour
{
    public string GetRandomSubject()
    {
        string[] subjects = { "음식", "동물", "직업" };
        int randomNumber = Random.Range(0, 3);
        return subjects[randomNumber];
    }

    public string GetRandomWord(string subject)
    {
        if (subject.Equals("음식"))
        {
            string[] words = {
                "단무지", "짜장면", "파스타", "타코", "초밥", "카레", "김치볶음밥", "김치찌개", "떡볶이", "족발",
                "불고기", "갈비찜", "삼겹살", "냉면", "라면", "떡갈비", "감자탕", "해물찜", "국밥", "간장게장",
                "샐러드", "국수", "피자", "햄버거", "치킨", "스테이크", "미역국", "순대국", "김밥", "만두",
                "떡꼬치", "샤브샤브", "돈까스", "오므라이스", "뼈해장국", "수제비", "탕수육", "곰탕", "장어", "마라탕",
                "양꼬치", "갈비찜", "삼계탕", "닭볶음탕", "쌈밥", "갈비탕", "매운탕", "낙지볶음", "아귀찜",
                "볶음밥", "김치전", "파전", "계란찜", "마파두부", "쫄면", "물냉면", "비빔냉면", "육회",
                "회덮밥", "제육볶음", "빈대떡", "토스트", "치킨", "찜닭", "콩국수",
                "죽", "도토리묵", "라볶이", "쌀국수", "양갈비", "수육", "막창", "꿔바로우", "쫄면",
                "소머리국밥", "닭갈비", "꽃게탕", "오리고기", "떡꼬치", "닭꼬치", "나베",
                "양장피", "연어"
            };
            int randomNumber = Random.Range(0, words.Length - 1);
            return words[randomNumber];
        }
        else if (subject.Equals("동물"))
        {
            string[] words = {
                "사자", "코끼리", "코뿔소", "기린", "호랑이", "치타", "표범", "늑대", "여우", "사슴",
                "캥거루", "원숭이", "고릴라", "참새", "독수리", "부엉이", "펭귄", "하마", "코알라", "바다소",
                "쥐", "고양이", "강아지", "햄스터", "토끼", "거북이", "이구아나", "원숭이", "판다", "악어",
                "말", "소", "돼지", "양", "닭", "오리", "고슴도치", "바다거북", "해마", "낙타",
                "콩벌레", "나비", "파리", "잠자리", "거미", "벌", "개미", "메뚜기", "도마뱀", "전갈",
                "쿼카", "앵무새", "카멜레온", "두더지","물소", "바다사자", "북극곰", "백호", "바다표범",
                "청개구리", "붉은여우", "북극여우", "오랑우탄", "알파카", "푸들", "치와와", "셰퍼드", "말티즈",
                "도베르만", "시바", "고슴도치", "토끼", "햄스터", "기니피그",
                "앵무새", "금붕어", "코코넛크랩", "돌고래"
                // 나머지 동물을 계속해서 추가하세요
            };
            int randomNumber = Random.Range(0, words.Length - 1);
            return words[randomNumber];
        }
        else if (subject.Equals("직업"))
        {
            string[] words = {
                "의사", "간호사", "선생님", "경찰관", "소방관", "건축가", "프로그래머", "디자이너", "엔지니어", "회계사",
                "변호사", "작가", "배우", "가수", "댄서", "요리사", "청소부", "운송기사", "판매원",
                "미용사", "헤어디자이너", "목수", "전기기사", "방송인", "저널리스트", "연구원", "과학자", "교육자", "상담사",
                "사회복지사", "토목기사", "경영자", "마케터","데이터분석가", "통역사", "번역가",
                "파일럿", "코치", "파일럿", "여행사 직원", "화가", "조향사", "퍼스널트레이너",
                "프로듀서", "피아니스트", "바리스타","노무사", "금속공예가",
                "화학공학자", "심리치료사", "기획자", "호텔리어", "바이올리니스트", "사진기사","화가",
                "수의사", "수영강사", "소설가", "뮤지컬배우", "음악강사", "사진작가", "토목공학자", "소방대원",
                "실내건축가", "편집자", "경비원","택배기사"
                // 나머지 직업을 계속해서 추가하세요
            };
            int randomNumber = Random.Range(0, words.Length - 1);
            return words[randomNumber];
        }
        return "해당주제없음";
    }
}
